In [ ]:
%load_ext sql
%sql sqlite:///enterprise_data.db

Here is the ERD used in this notebook.

![title](sql-exercise-erd.jpg)

In [ ]:
%%sql
DROP TABLE IF EXISTS DEPARTMENT;
CREATE TABLE DEPARTMENT (
    DNAME    VARCHAR(15) NOT NULL,
    DNUMBER INT NOT NULL,
    MGRSSN CHAR(9), 
    MGRSTARTDATE DATE,
    PRIMARY KEY(DNUMBER),
    FOREIGN KEY (MGRSSN) REFERENCES EMPLOYEE(SSN)
);
INSERT INTO DEPARTMENT (DNAME, DNUMBER, MGRSSN, MGRSTARTDATE) VALUES ('Headquarters', 1, NULL, NULL); 
INSERT INTO DEPARTMENT (DNAME, DNUMBER, MGRSSN, MGRSTARTDATE) VALUES ('Research', 5, NULL, NULL); 
INSERT INTO DEPARTMENT (DNAME, DNUMBER, MGRSSN, MGRSTARTDATE) VALUES ('Administration', 4, NULL, NULL); 

DROP TABLE IF EXISTS EMPLOYEE;
CREATE TABLE EMPLOYEE (
  FNAME VARCHAR(15) NOT NULL,
  MINIT CHAR(1),
  LNAME VARCHAR(15) NOT NULL,
  SSN CHAR(9)   NOT NULL,
  BDATE    DATE,   
  ADDRESS    VARCHAR(30),
  SEX      CHAR(1),
  SALARY    DECIMAL(10,2),
  SUPERSSN  CHAR(9),
  DNO      INT      NOT NULL,
  PRIMARY KEY (SSN),
  FOREIGN KEY (DNO) REFERENCES DEPARTMENT(DNUMBER),
  FOREIGN KEY (SUPERSSN) REFERENCES EMPLOYEE(SSN)
);

INSERT INTO EMPLOYEE (FNAME, MINIT, LNAME, SSN, BDATE, ADDRESS, SEX, SALARY, SUPERSSN, DNO) 
VALUES ('James', 'E', 'Borg', '888665555', '1927-11-10', '50 Stone, Houston, TX', 'M', 55000, NULL, 1);
INSERT INTO EMPLOYEE (FNAME, MINIT, LNAME, SSN, BDATE, ADDRESS, SEX, SALARY, SUPERSSN, DNO) 
VALUES ('Franklin', 'T', 'Wong', '333445555', '1945-12-08', '638 Voss, Houston, TX', 'M', 40000, '888665555', 5);
INSERT INTO EMPLOYEE (FNAME, MINIT, LNAME, SSN, BDATE, ADDRESS, SEX, SALARY, SUPERSSN, DNO) 
VALUES ('Jennifer', 'S', 'Wallace', '987654321', '1931-06-20', '291 Berry, Bellaire, TX', 'F', 43000, '888665555', 4);
 
UPDATE DEPARTMENT SET MGRSSN = '888665555', MGRSTARTDATE = '19-JUN-71' WHERE DNUMBER = 1; 
UPDATE DEPARTMENT SET MGRSSN = '333445555', MGRSTARTDATE = '22-MAY-78' WHERE DNUMBER = 5; 
UPDATE DEPARTMENT SET MGRSSN = '987654321', MGRSTARTDATE = '01-JAN-85' WHERE DNUMBER = 4; 

INSERT INTO EMPLOYEE (FNAME, MINIT, LNAME, SSN, BDATE, ADDRESS, SEX, SALARY, SUPERSSN, DNO) 
VALUES ('John', 'B', 'Smith', '123456789', '1955-01-09', '731 Fondren Houston, TX', 'M', 30000, '3334455555', 5);
INSERT INTO EMPLOYEE (FNAME, MINIT, LNAME, SSN, BDATE, ADDRESS, SEX, SALARY, SUPERSSN, DNO) 
VALUES ('Ramesh', 'K', 'Narayan', '666884444', '1952-09-15', '975 Fire Oak, Humble, TX', 'M', 38000, '333445555', 5);
INSERT INTO EMPLOYEE (FNAME, MINIT, LNAME, SSN, BDATE, ADDRESS, SEX, SALARY, SUPERSSN, DNO) 
VALUES ('Joyce', 'A', 'English', '453453453', '1962-07-31', '5631 Rice, Houston, TX', 'F', 25000, '333445555', 5);
INSERT INTO EMPLOYEE (FNAME, MINIT, LNAME, SSN, BDATE, ADDRESS, SEX, SALARY, SUPERSSN, DNO) 
VALUES ('Alicia', 'J', 'Zalaya', '999887777', '1958-07-19', '3321 Castle, Spring, TX', 'F', 25000, '987654321', 4);
INSERT INTO EMPLOYEE (FNAME, MINIT, LNAME, SSN, BDATE, ADDRESS, SEX, SALARY, SUPERSSN, DNO) 
VALUES ('Ahmad', 'V', 'Jabbar', '987987987', '1959-03-29', '985 Dallas, Houston, TX', 'M', 25000, '987654321', 4);

DROP TABLE IF EXISTS DEPT_LOCATIONS;
CREATE TABLE DEPT_LOCATIONS (
    DNUMBER       INT      NOT NULL,
  DLOCATION  VARCHAR(15)  NOT NULL,
  PRIMARY KEY (DNUMBER, DLOCATION),
  FOREIGN KEY (DNUMBER) REFERENCES DEPARTMENT (DNUMBER)
);
 
INSERT INTO DEPT_LOCATIONS VALUES (1, 'Houston'); 
INSERT INTO DEPT_LOCATIONS VALUES (4, 'Stafford'); 
INSERT INTO DEPT_LOCATIONS VALUES (5, 'Bellaire'); 
INSERT INTO DEPT_LOCATIONS VALUES (5, 'Sugarland'); 
INSERT INTO DEPT_LOCATIONS VALUES (5, 'Houston'); 

DROP TABLE IF EXISTS PROJECT;
CREATE TABLE PROJECT (
    PNAME    VARCHAR(15)  NOT NULL,
  PNUMBER      INT      NOT NULL,
  PLOCATION  VARCHAR(15),
  DNUM      INT      NOT NULL,
  PRIMARY KEY (PNUMBER),
  FOREIGN KEY (DNUM) REFERENCES DEPARTMENT (DNUMBER)
);
 
INSERT INTO PROJECT (PNAME, PNUMBER, PLOCATION, DNUM) VALUES ('ProductX', 1, 'Bellaire', 5); 
INSERT INTO PROJECT (PNAME, PNUMBER, PLOCATION, DNUM) VALUES ('ProductY', 2, 'Sugarland', 5); 
INSERT INTO PROJECT (PNAME, PNUMBER, PLOCATION, DNUM) VALUES ('ProductZ', 3, 'Houston', 5); 
INSERT INTO PROJECT (PNAME, PNUMBER, PLOCATION, DNUM) VALUES ('Computerization', 10, 'Stafford', 4); 
INSERT INTO PROJECT (PNAME, PNUMBER, PLOCATION, DNUM) VALUES ('Reorganization', 20, 'Houston', 1); 
INSERT INTO PROJECT (PNAME, PNUMBER, PLOCATION, DNUM) VALUES ('NewBenefits', 30, 'Stafford', 4); 

DROP TABLE IF EXISTS WORKS_ON;
CREATE TABLE WORKS_ON (
    ESSN    CHAR(9)  NOT NULL,
  PNO      INT    NOT NULL,
  HOURS    DECIMAL (3, 1),
  PRIMARY KEY (ESSN, PNO),
  FOREIGN KEY (ESSN) REFERENCES EMPLOYEE (SSN),
  FOREIGN KEY (PNO) REFERENCES PROJECT (PNUMBER)
); 
 
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('123456789', 1, 32.5);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('123456789', 2, 7.5);
--INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('123456789', 3, 8.5);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('666884444', 3, 40.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('453453453', 1, 20.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('453453453', 2, 20.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('333445555', 2, 10.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('333445555', 3, 10.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('333445555', 10, 10.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('333445555', 20, 10.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('999887777', 30, 30.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('999887777', 10, 30.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('987987987', 10, 35.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('987987987', 30, 5.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('987654321', 30, 20.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('987654321', 20, 15.0);
INSERT INTO WORKS_ON (ESSN, PNO, HOURS) VALUES ('888665555', 20, null);

DROP TABLE IF EXISTS DEPENDENT;
CREATE TABLE DEPENDENT (
    ESSN      CHAR(9)    NOT NULL,
  DEPENDENT_NAME    VARCHAR(15)  NOT NULL,
  SEX        CHAR(1),
  BDATE      DATE,
  RELATIONSHIP  VARCHAR(8),
  PRIMARY KEY(ESSN, DEPENDENT_NAME),
  FOREIGN KEY (ESSN) REFERENCES EMPLOYEE (SSN)
);
 
INSERT INTO DEPENDENT (ESSN, DEPENDENT_NAME, SEX, BDATE, RELATIONSHIP) 
VALUES ('333445555', 'Alice', 'F', '05-APR-76', 'DAUGHTER'); 
INSERT INTO DEPENDENT (ESSN, DEPENDENT_NAME, SEX, BDATE, RELATIONSHIP) 
VALUES ('333445555', 'Theodore', 'M', '25-OCT-73', 'SON'); 
INSERT INTO DEPENDENT (ESSN, DEPENDENT_NAME, SEX, BDATE, RELATIONSHIP) 
VALUES ('333445555', 'Franklin', 'F', '03-MAY-48', 'SPOUSE'); 
INSERT INTO DEPENDENT (ESSN, DEPENDENT_NAME, SEX, BDATE, RELATIONSHIP) 
VALUES ('987654321', 'Abner', 'M', '29-FEB-32', 'SPOUSE'); 
INSERT INTO DEPENDENT (ESSN, DEPENDENT_NAME, SEX, BDATE, RELATIONSHIP) 
VALUES ('123456789', 'Michael', 'M', '01-JAN-78', 'SON');
INSERT INTO DEPENDENT (ESSN, DEPENDENT_NAME, SEX, BDATE, RELATIONSHIP) 
VALUES ('123456789', 'Alice', 'F', '31-DEC-78', 'DAUGHTER'); 
INSERT INTO DEPENDENT (ESSN, DEPENDENT_NAME, SEX, BDATE, RELATIONSHIP) 
VALUES ('123456789', 'Elizabeth', 'F', '05-MAY-57', 'SPOUSE');

Query 0: Retrieve the birthdate and address of the employee whose
name is 'John B. Smith'.

In [ ]:
%%sql

In [100]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'1955-01-09', u'731 Fondren Houston, TX')]

Query 1: Retrieve the name and address of all employees who work for
the 'Research' department.

In [ ]:
%%sql

In [6]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'Franklin', u'Wong', u'638 Voss, Houston, TX'),
 (u'John', u'Smith', u'731 Fondren Houston, TX'),
 (u'Ramesh', u'Narayan', u'975 Fire Oak, Humble, TX'),
 (u'Joyce', u'English', u'5631 Rice, Houston, TX')]

Query 2: For every project located in 'Stafford', list the project number, the
controlling department number, and the department manager's last name,
address, and birthdate.

In [ ]:
%%sql

In [98]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(10, 4, u'Wallace', u'1931-06-20', u'291 Berry, Bellaire, TX'),
 (30, 4, u'Wallace', u'1931-06-20', u'291 Berry, Bellaire, TX')]

Query 3: For each employee, retrieve the employee's name, and the name
of his or her immediate supervisor.

In [ ]:
%%sql

In [56]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'Franklin', u'Wong', u'James', u'Borg'),
 (u'Jennifer', u'Wallace', u'James', u'Borg'),
 (u'Ramesh', u'Narayan', u'Franklin', u'Wong'),
 (u'Joyce', u'English', u'Franklin', u'Wong'),
 (u'Alicia', u'Zalaya', u'Jennifer', u'Wallace'),
 (u'Ahmad', u'Jabbar', u'Jennifer', u'Wallace')]

Query 4: Make a list of all project names for projects that involve an
employee whose last name is 'Smith' as a worker or as a manager of
the department that controls the project.

In [ ]:
%%sql

In [78]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'ProductX',), (u'ProductY',)]

_The comparison operator **IN** compares a value v with a set (or multi-set)
of values V, and evaluates to **TRUE** if v is one of the elements in V_

_**EXISTS** is used to check whether the result of a correlated nested query is empty (contains no tuples) or not_

Query 5: Retrieve the name of each employee who has a dependent
with the same first name as the employee.

In [ ]:
%%sql

In [85]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'Franklin', u'Wong')]

_It is also possible to use an explicit (enumerated) set of values in the WHERE-clause rather than a nested query_

Query 6: Retrieve the social security numbers of all employees who work on project number 1, 2, or 3.

In [ ]:
%%sql

In [88]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'123456789',), (u'333445555',), (u'453453453',), (u'666884444',)]

_The **IN** operator compares two sets of values , and returns **TRUE** if one set contains all values in the other set (reminiscent of the division operation of algebra)._

Query 7: Retrieve the name of each employee who works on some of the projects
controlled by department number 5.

In [ ]:
%%sql

In [58]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'Franklin', u'Wong', u'333445555'),
 (u'John', u'Smith', u'123456789'),
 (u'Ramesh', u'Narayan', u'666884444'),
 (u'Joyce', u'English', u'453453453')]

Query 7a: Retrieve the name of each employee who works on all the projects
controlled by department number 5.

In [ ]:
%%sql

In [57]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[]

_SQL uses **IS** or **IS NOT** to compare NULLs because it considers each NULL value distinct from other NULL_

Query 8: Retrieve the names of all employees who do not have supervisors.

In [ ]:
%%sql

In [90]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'James', u'Borg')]

Query 9: Retrieve the employee’s first and last name, and the first and last name of his or her immediate supervisor.

In [ ]:
%%sql

In [93]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'James', u'Borg', None, None),
 (u'Franklin', u'Wong', u'James', u'Borg'),
 (u'Jennifer', u'Wallace', u'James', u'Borg'),
 (u'John', u'Smith', None, None),
 (u'Ramesh', u'Narayan', u'Franklin', u'Wong'),
 (u'Joyce', u'English', u'Franklin', u'Wong'),
 (u'Alicia', u'Zalaya', u'Jennifer', u'Wallace'),
 (u'Ahmad', u'Jabbar', u'Jennifer', u'Wallace')]

Query 9a: to retrieve the last name of each employee and his or her supervisor, while renaming the resulting attribute names as EMPLOYEE_NAME and SUPERVISOR_NAME

In [94]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'Borg', None),
 (u'Wong', u'Borg'),
 (u'Wallace', u'Borg'),
 (u'Smith', None),
 (u'Narayan', u'Wong'),
 (u'English', u'Wong'),
 (u'Zalaya', u'Wallace'),
 (u'Jabbar', u'Wallace')]

Query 10: For every project located in 'Stafford', list the project number, the
controlling department number, and the department manager's last name,
address, and birthdate.

In [97]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(10, 4, u'Wallace', u'1931-06-20', u'291 Berry, Bellaire, TX'),
 (30, 4, u'Wallace', u'1931-06-20', u'291 Berry, Bellaire, TX')]

_Include COUNT, SUM, MAX, MIN, and AVG_

Query 11: Find the maximum salary, the minimum salary, and
the average salary among all employees.

In [ ]:
%%sql

In [ ]:
"""
Expected output below

Don't re-execute this cell!
"""

Query 12: Find the maximum salary, the minimum salary, and the average salary among employees who work for the 'Research' department

In [ ]:
%%sql

In [101]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(40000, 25000, 33250.0)]

_SQL has a **GROUP BY**-clause for specifying the grouping attributes, which must also appear in the SELECT-clause_

Query 13: For each department, retrieve the department number, the number of employees in the department, and their average salary.

In [ ]:
%%sql

In [102]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(1, 1, 55000.0), (4, 3, 31000.0), (5, 4, 33250.0)]

Query 14: For each project, retrieve the project number, project
name, and the number of employees who work on that project.

In [ ]:
%%sql

In [103]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(1, u'ProductX', 2),
 (2, u'ProductY', 3),
 (3, u'ProductZ', 2),
 (10, u'Computerization', 3),
 (20, u'Reorganization', 3),
 (30, u'NewBenefits', 3)]

_The **HAVING**-clause is used for specifying a selection condition on groups (rather than on individual tuples)_

Query 15: For each project on which more than two employees work, retrieve the project number, project name, and the number of employees who work on that project.

In [ ]:
%%sql

In [104]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(2, u'ProductY', 3),
 (10, u'Computerization', 3),
 (20, u'Reorganization', 3),
 (30, u'NewBenefits', 3)]

Summary: A query in SQL can consist of up to six clauses, but only
the first two, SELECT and FROM, are mandatory.

The
clauses are specified in the following order:

```sql
SELECT <attribute list>
FROM <table list>
[WHERE <condition>]
[GROUP BY <grouping attribute(s)>]
[HAVING <group condition>]
[ORDER BY <attribute list>]
```

 - The SELECT-clause lists the attributes or functions to be retrieved
 - The FROM-clause specifies all relations (or aliases) needed in the query but not those needed in nested queries
 - The WHERE-clause specifies the conditions for selection and join of tuples from the relations specified in the FROM-clause
 - GROUP BY specifies grouping attributes 
 - HAVING specifies a condition for selection of groups
 - ORDER BY specifies an order for displaying the result of a query
 - A query is evaluated by first applying the WHERE-clause, then GROUP BY and HAVING, and finally the SELECT-clause

Query 16: Select all EMPLOYEE SSNs in the database

In [ ]:
%%sql

In [105]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'123456789',),
 (u'333445555',),
 (u'453453453',),
 (u'666884444',),
 (u'888665555',),
 (u'987654321',),
 (u'987987987',),
 (u'999887777',)]

Query 17: Select all combination of EMPLOYEE SSN and DEPARTMENT DNAME in the database

In [ ]:
%%sql

In [106]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'123456789', u'Headquarters'),
 (u'333445555', u'Headquarters'),
 (u'453453453', u'Headquarters'),
 (u'666884444', u'Headquarters'),
 (u'888665555', u'Headquarters'),
 (u'987654321', u'Headquarters'),
 (u'987987987', u'Headquarters'),
 (u'999887777', u'Headquarters'),
 (u'123456789', u'Research'),
 (u'333445555', u'Research'),
 (u'453453453', u'Research'),
 (u'666884444', u'Research'),
 (u'888665555', u'Research'),
 (u'987654321', u'Research'),
 (u'987987987', u'Research'),
 (u'999887777', u'Research'),
 (u'123456789', u'Administration'),
 (u'333445555', u'Administration'),
 (u'453453453', u'Administration'),
 (u'666884444', u'Administration'),
 (u'888665555', u'Administration'),
 (u'987654321', u'Administration'),
 (u'987987987', u'Administration'),
 (u'999887777', u'Administration')]

Query 18: Select the CROSS PRODUCT of the EMPLOYEE and DEPARTMENT relations

In [ ]:
%%sql

In [107]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'James', u'E', u'Borg', u'888665555', u'1927-11-10', u'50 Stone, Houston, TX', u'M', 55000, None, 1, u'Headquarters', 1, u'888665555', u'19-JUN-71'),
 (u'James', u'E', u'Borg', u'888665555', u'1927-11-10', u'50 Stone, Houston, TX', u'M', 55000, None, 1, u'Research', 5, u'333445555', u'22-MAY-78'),
 (u'James', u'E', u'Borg', u'888665555', u'1927-11-10', u'50 Stone, Houston, TX', u'M', 55000, None, 1, u'Administration', 4, u'987654321', u'01-JAN-85'),
 (u'Franklin', u'T', u'Wong', u'333445555', u'1945-12-08', u'638 Voss, Houston, TX', u'M', 40000, u'888665555', 5, u'Headquarters', 1, u'888665555', u'19-JUN-71'),
 (u'Franklin', u'T', u'Wong', u'333445555', u'1945-12-08', u'638 Voss, Houston, TX', u'M', 40000, u'888665555', 5, u'Research', 5, u'333445555', u'22-MAY-78'),
 (u'Franklin', u'T', u'Wong', u'333445555', u'1945-12-08', u'638 Voss, Houston, TX', u'M', 40000, u'888665555', 5, u'Administration', 4, u'987654321', u'01-JAN-85'),
 (u'Jennifer', u'S', u'Wallace', u'987654321', u'1931-06-20', u'291 Berry, Bellaire, TX', u'F', 43000, u'888665555', 4, u'Headquarters', 1, u'888665555', u'19-JUN-71'),
 (u'Jennifer', u'S', u'Wallace', u'987654321', u'1931-06-20', u'291 Berry, Bellaire, TX', u'F', 43000, u'888665555', 4, u'Research', 5, u'333445555', u'22-MAY-78'),
 (u'Jennifer', u'S', u'Wallace', u'987654321', u'1931-06-20', u'291 Berry, Bellaire, TX', u'F', 43000, u'888665555', 4, u'Administration', 4, u'987654321', u'01-JAN-85'),
 (u'John', u'B', u'Smith', u'123456789', u'1955-01-09', u'731 Fondren Houston, TX', u'M', 30000, u'3334455555', 5, u'Headquarters', 1, u'888665555', u'19-JUN-71'),
 (u'John', u'B', u'Smith', u'123456789', u'1955-01-09', u'731 Fondren Houston, TX', u'M', 30000, u'3334455555', 5, u'Research', 5, u'333445555', u'22-MAY-78'),
 (u'John', u'B', u'Smith', u'123456789', u'1955-01-09', u'731 Fondren Houston, TX', u'M', 30000, u'3334455555', 5, u'Administration', 4, u'987654321', u'01-JAN-85'),
 (u'Ramesh', u'K', u'Narayan', u'666884444', u'1952-09-15', u'975 Fire Oak, Humble, TX', u'M', 38000, u'333445555', 5, u'Headquarters', 1, u'888665555', u'19-JUN-71'),
 (u'Ramesh', u'K', u'Narayan', u'666884444', u'1952-09-15', u'975 Fire Oak, Humble, TX', u'M', 38000, u'333445555', 5, u'Research', 5, u'333445555', u'22-MAY-78'),
 (u'Ramesh', u'K', u'Narayan', u'666884444', u'1952-09-15', u'975 Fire Oak, Humble, TX', u'M', 38000, u'333445555', 5, u'Administration', 4, u'987654321', u'01-JAN-85'),
 (u'Joyce', u'A', u'English', u'453453453', u'1962-07-31', u'5631 Rice, Houston, TX', u'F', 25000, u'333445555', 5, u'Headquarters', 1, u'888665555', u'19-JUN-71'),
 (u'Joyce', u'A', u'English', u'453453453', u'1962-07-31', u'5631 Rice, Houston, TX', u'F', 25000, u'333445555', 5, u'Research', 5, u'333445555', u'22-MAY-78'),
 (u'Joyce', u'A', u'English', u'453453453', u'1962-07-31', u'5631 Rice, Houston, TX', u'F', 25000, u'333445555', 5, u'Administration', 4, u'987654321', u'01-JAN-85'),
 (u'Alicia', u'J', u'Zalaya', u'999887777', u'1958-07-19', u'3321 Castle, Spring, TX', u'F', 25000, u'987654321', 4, u'Headquarters', 1, u'888665555', u'19-JUN-71'),
 (u'Alicia', u'J', u'Zalaya', u'999887777', u'1958-07-19', u'3321 Castle, Spring, TX', u'F', 25000, u'987654321', 4, u'Research', 5, u'333445555', u'22-MAY-78'),
 (u'Alicia', u'J', u'Zalaya', u'999887777', u'1958-07-19', u'3321 Castle, Spring, TX', u'F', 25000, u'987654321', 4, u'Administration', 4, u'987654321', u'01-JAN-85'),
 (u'Ahmad', u'V', u'Jabbar', u'987987987', u'1959-03-29', u'985 Dallas, Houston, TX', u'M', 25000, u'987654321', 4, u'Headquarters', 1, u'888665555', u'19-JUN-71'),
 (u'Ahmad', u'V', u'Jabbar', u'987987987', u'1959-03-29', u'985 Dallas, Houston, TX', u'M', 25000, u'987654321', 4, u'Research', 5, u'333445555', u'22-MAY-78'),
 (u'Ahmad', u'V', u'Jabbar', u'987987987', u'1959-03-29', u'985 Dallas, Houston, TX', u'M', 25000, u'987654321', 4, u'Administration', 4, u'987654321', u'01-JAN-85')]

Query 19: Retrieve the salary of every employee

In [ ]:
%%sql

In [110]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(55000,),
 (40000,),
 (43000,),
 (30000,),
 (38000,),
 (25000,),
 (25000,),
 (25000,)]

Query 19a: Retrieve all distinct salary values

In [ ]:
%%sql

In [111]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(55000,), (40000,), (43000,), (30000,), (38000,), (25000,)]

Query 20: Retrieve all employees whose address is in `Houston, TX`

In [ ]:
%%sql

In [117]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'James', u'Borg'),
 (u'Franklin', u'Wong'),
 (u'John', u'Smith'),
 (u'Joyce', u'English'),
 (u'Ahmad', u'Jabbar')]

Query 21: Show the resulting salaries if every employee working on the ‘ProductX’ project is given a 10 percent raise

In [ ]:
%%sql

In [120]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'John', u'Smith', 33000.0), (u'Joyce', u'English', 27500.000000000004)]

Query 22: Retrieve all employees in department 5 whose salary is between 30,000 and 40,000

In [ ]:
%%sql

In [121]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'Franklin', u'T', u'Wong', u'333445555', u'1945-12-08', u'638 Voss, Houston, TX', u'M', 40000, u'888665555', 5),
 (u'John', u'B', u'Smith', u'123456789', u'1955-01-09', u'731 Fondren Houston, TX', u'M', 30000, u'3334455555', 5),
 (u'Ramesh', u'K', u'Narayan', u'666884444', u'1952-09-15', u'975 Fire Oak, Humble, TX', u'M', 38000, u'333445555', 5)]

Query 23: Retrieve a list of employees and the projects they are working on, ordered by department and, within each department, ordered alphabetically by last name, first name

In [ ]:
%%sql

In [122]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(u'Research', u'English', u'Joyce', u'ProductX'),
 (u'Research', u'English', u'Joyce', u'ProductY'),
 (u'Research', u'Narayan', u'Ramesh', u'ProductZ'),
 (u'Research', u'Smith', u'John', u'ProductX'),
 (u'Research', u'Smith', u'John', u'ProductY'),
 (u'Research', u'Wong', u'Franklin', u'ProductY'),
 (u'Research', u'Wong', u'Franklin', u'ProductZ'),
 (u'Research', u'Wong', u'Franklin', u'Computerization'),
 (u'Research', u'Wong', u'Franklin', u'Reorganization'),
 (u'Headquarters', u'Borg', u'James', u'Reorganization'),
 (u'Administration', u'Jabbar', u'Ahmad', u'Computerization'),
 (u'Administration', u'Jabbar', u'Ahmad', u'NewBenefits'),
 (u'Administration', u'Wallace', u'Jennifer', u'Reorganization'),
 (u'Administration', u'Wallace', u'Jennifer', u'NewBenefits'),
 (u'Administration', u'Zalaya', u'Alicia', u'Computerization'),
 (u'Administration', u'Zalaya', u'Alicia', u'NewBenefits')]

Query 24: Retrieve the total number of employees in the company

In [ ]:
%%sql

In [125]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(8,)]

Query 25: Retrieve the number of employees in the 'Research' department

In [ ]:
%%sql

In [126]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(4,)]

Query 26: Count the number of distinct salary values in the database

In [ ]:
%%sql

In [127]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(6,)]

Query 27: For each project, retrieve the project number, the project name, and the number of employees from department 5 who work on the project

In [ ]:
%%sql

In [131]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(1, u'ProductX', 2),
 (2, u'ProductY', 3),
 (3, u'ProductZ', 2),
 (10, u'Computerization', 1),
 (20, u'Reorganization', 1)]

Query 28: For each department that has more than two employees, retrieve the department number and the number of its employees who are making more than 40,000

In [ ]:
%%sql

In [135]:
"""
Expected output below

Don't re-execute this cell!
"""

 * sqlite:///enterprise_data.db
Done.

[(4, 1)]